/*--------------------------------------------------------- 
程序： 模拟笔记本电脑   （纯C语言，可直接编译器运行） 
作者： 404name
说明： 1.这个程序本意在模拟电脑的基本功能，重在实现键盘的输入与键盘的控制，模拟开机，输密，打开软件，关闭电脑，所以其他功能暂没开发，不用太失望。 
	   2.不同的编码会有不同的长度显示，但运行出来的效果都是一样的 
	   3.代码规范不到位，见谅。 
	   4.大一上写的，一般写小游戏练手，也琢磨到一些特殊的处理方法，所以对一些功能处理上有一些难理解的地方。 
       5.emmm，没啥了
       6.感觉大一下太难了。qwq，在家学习效率太低。尽力学点新东西把。
程序进度： 于2.10号停止更新（目前不再会加入新功能了，模板搭建完了，功能已经全部写完，再加入一些东西也没太大意义，还是去学学java去了）
程序结构： 程序因为加入了打砖块，部分函数顺序需要调换，影响体验。此处给出按顺序的走法。
           这里其实总体上是有顺序的，但代码太多看起来就很乱。
           解决方案：先定义函数再在主函数后面分类写。并没有采用，因为习惯性写前面，嘿嘿。。

        |变量区：（数组+变量）
        |子函数区： 
            ·系统自带函数：光标隐藏+gotoxy
            ·汉诺塔执行相关函数
            ·主程序init函数
            ·主程序界面加载函数：
                ·开机画面
                ·关机画面
                ·蓝屏画面
                ·更多信息画面
                ·电脑系统配置画面
            ·打砖块执行相关函数
            ·主程序功能函数：
                ·处理返回的字符型按键函数
                ·处理返回的功能型按键函数
        |主函数：
            ·主循环
修复历史：
    （2020）
    3.10修复字符显示乱码
    3.15修复关机仍能输入密码
    3.15加入光标隐藏（关闭前往init函数第一行）
    3.19加入可移动游戏简洁版，可前往main函数自己开关
    4.07丰富细节，更加贴近xp系统。
            ·密码输入优化，输入的密码会在下一次输入变成不可视。
            ·优化打砖块对角碰撞算法，更加真实。
            ·新增“此电脑”可查看电脑配置.
            ·新增关机画面。
            ·优化细节.
指路区： 1.自制地图插入 前往my_map[][]数组 大概300多行处修改；
         2.打砖块抛物线算法解析 前往autochange()函数 1000多行处
 ---------------------------------------------------------*/
#include <conio.h> //用于getch（）
#include <math.h>
#include <stdio.h>
#include <string.h>
#include <windows.h>
#define pi 3.14
const double g = 10;    //标准数越模糊，轨迹越连贯。

//功能数组
int keyboard[20][30] = {
    //把键盘看成一个地图让move函数在上面移动返回的数值对应下面的 board_place[120][5]是对应按键的全部信息
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 1, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 104, 104, 104, 104},
    {0, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37},
    {0, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58},
    {0, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 71, 0, 0, 0, 72, 73, 74, 58},
    {0, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 86, 86, 0, 87, 0, 88, 89, 90, 91},
    {0, 92, 93, 94, 95, 95, 95, 95, 95, 95, 95, 96, 97, 98, 98, 99, 100, 101, 102, 102, 103, 91},
};
int next[9][2] = {{0}, {0}, {0}, {0}, {0}, {-1, 0}, {0, -1}, {1, 0}, {0, 1}}; //给键盘传给虚拟键盘的键盘控制虚拟电脑用
int computer_map[3][8] = {{0, 0, 0, 0, 0}, {0, 1, 2, 3, 4}, {0, 5, 0, 0, 0}}; //对应的移动操作记录
int computer_map_place[6][2] = {{0}, {2, 9}, {2, 19}, {2, 29}, {2, 40}, {6, 12}};
int cx, cy, tcx, tcy, lcx, lcy;
int board_place[120][5] = { //这是按键的信息  下标依次对应  -返回值 -按下shift下的返回值2  -键盘字符长度  -字符坐标x   -y
    {0, 0, 0, 0, 0},        //第一项如果是字符那么那就是返回字符    如果是数字1-9那么就是功能按键功能对应如下
    {1, 1, 3, 21, 19},      //1-10
    {0, 0, 2, 21, 28},      //1 ~ 返回    2 ~删除     3确认   4shift  5上 6左 7下 8又  9开机
    {0, 0, 2, 21, 32},
    {0, 0, 2, 21, 36},
    {0, 0, 2, 21, 40},
    {0, 0, 2, 21, 45},
    {0, 0, 2, 21, 49},
    {0, 0, 2, 21, 53},
    {0, 0, 2, 21, 57},
    {0, 0, 2, 21, 62},
    {0, 0, 3, 21, 65}, // 11
    {0, 0, 3, 21, 69},
    {0, 0, 3, 21, 73},
    {0, 0, 3, 21, 78},
    {0, 0, 3, 21, 82},
    {0, 0, 3, 21, 86},
    {'`', '~', 2, 24, 19},
    {'1', '!', 2, 24, 24},
    {'2', '@', 2, 24, 28},
    {'3', '#', 2, 24, 32},
    {'4', '$', 2, 24, 36}, // 21
    {'5', '%', 2, 24, 40},
    {'6', '^', 2, 24, 44},
    {'7', '&', 2, 24, 48},
    {'8', '*', 2, 24, 52},
    {'9', '(', 2, 24, 56},
    {'0', ')', 2, 24, 60},
    {'-', '_', 2, 24, 64},
    {'=', '+', 2, 24, 68},
    {2, 2, 4, 24, 72},
    {0, 0, 3, 24, 78}, // 31
    {0, 0, 3, 24, 82},
    {0, 0, 3, 24, 86},
    {0, 0, 3, 24, 91},
    {'/', '/', 1, 24, 96},
    {'*', '*', 1, 24, 100},
    {'-', '-', 1, 24, 104},
    {0, 0, 3, 26, 19},
    {'q', 'Q', 1, 26, 25},
    {'w', 'W', 1, 26, 29},
    {'e', 'E', 1, 26, 33}, // 41
    {'r', 'R', 1, 26, 37},
    {'t', 'T', 1, 26, 41},
    {'y', 'Y', 1, 26, 45},
    {'u', 'U', 1, 26, 49},
    {'i', 'I', 1, 26, 53},
    {'o', 'O', 1, 26, 57},
    {'p', 'P', 1, 26, 61},
    {'[', '{', 2, 26, 65},
    {']', '}', 2, 26, 69},
    {'\\', '|', 2, 26, 73}, // 51
    {0, 0, 3, 26, 78},
    {0, 0, 3, 26, 82},
    {0, 0, 3, 26, 86},
    {'7', '7', 1, 26, 92},
    {'8', '8', 1, 26, 96},
    {'9', '9', 1, 26, 100},
    {'+', '+', 1, 27, 104},
    {4, 4, 4, 28, 19},
    {'a', 'A', 1, 28, 26},
    {'s', 'S', 1, 28, 30}, // 61
    {'d', 'D', 1, 28, 34},
    {'f', 'F', 1, 28, 38},
    {'g', 'G', 1, 28, 42},
    {'h', 'H', 1, 28, 46},
    {'j', 'J', 1, 28, 50},
    {'k', 'K', 1, 28, 54},
    {'l', 'L', 1, 28, 58},
    {';', ':', 2, 28, 62},
    {'\'', '\"', 2, 28, 66},
    {3, 3, 5, 28, 70}, // 71
    {'4', '4', 1, 28, 92},
    {'5', '5', 1, 28, 96},
    {'6', '6', 1, 28, 100},
    {4, 4, 5, 30, 19},
    {'z', 'Z', 1, 30, 27},
    {'x', 'X', 1, 30, 31},
    {'c', 'C', 1, 30, 35},
    {'v', 'V', 1, 30, 39},
    {'b', 'B', 1, 30, 43},
    {'n', 'N', 1, 30, 47}, // 81
    {'m', 'M', 1, 30, 51},
    {',', '<', 2, 30, 55},
    {'.', '>', 2, 30, 59},
    {'/', '?', 2, 30, 63},
    {4, 4, 5, 30, 69},
    {5, 5, 2, 30, 83},
    {'1', '1', 1, 30, 92},
    {'2', '2', 1, 30, 96},
    {'3', '3', 1, 30, 100},
    {3, 3, 3, 32, 103}, // 91
    {0, 0, 3, 32, 19},
    {0, 0, 3, 32, 24},
    {0, 0, 3, 32, 29},
    {' ', ' ', 4, 32, 45},
    {0, 0, 3, 32, 62},
    {0, 0, 2, 32, 67},
    {0, 0, 4, 32, 71},
    {6, 6, 2, 32, 78},
    {7, 7, 2, 32, 83},
    {8, 8, 2, 32, 87}, // 101
    {'0', '0', 4, 32, 93},
    {'.', '.', 4, 32, 99},
    {9, 9, 4, 18, 99}};

//  程序功能变量
int flag, function, if_shift, if_start, if_input_password, if_into_desktop, if_game, qpz; //0表示输入无效，1表示是输入电脑键 2表示是功能键
char letter;
int x, y, tx, ty, num, lx, ly;
char temp[6] = {"====="};
char put_in_computer[20];
char password_0[20] = {"WHJY"}; // 密码
int put_in_num, if_input, input_x, input_y, input_max;
//  汉诺塔游戏变量
int mid_x, mid_y;
int len, width, left, mid, right, time;
int ttx, tty;
char game_map[80][1000];
int game_next[4][2] = {{-1, 0}, {1, 0}, {0, -1}, {0, 1}}; //上0下1左2右3；

int turn[2][3] = {{0, 3, 1},  //a -> b   b -> c a -> c  上右下
                  {0, 2, 1}}; //b -> a  c -> b  c -> a	上左下     //实现自动移动的路线储存

//打砖块游戏变量
char map2[1000][1000];
char End[20][50] = {
    {"  ##     ##            ##      "},
    {"  ##  ######### ###############"},
    {" ##   ######### ###############"},
    {"##  ##   ##            ##      "},
    {"###### #######    ############ "},
    {"  ##   #######    ############ "},
    {" ##               ##   ##   ## "},
    {"###### #######    ############ "},
    {"###### #######       #####     "},
    {"       ##   ##      ## ####    "},
    {"   ### ##   ##     ##  ## ##   "},
    {"###### #######   ###   ##  ### "},
    {"###    #######   ##    ##   ## "},
    {"       ##   ##         ##      "},
    {"  按   任   意   键   继   续  "},
};
//-----------------------------------------------------------------------------------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------------------------------------------------------------------------------
//此处是人工地图接口（开启请前往main函数里面设置下面0为1并且自己改变图案）
int if_my_map;
char my_map[50][500] = {{"#############################################################################################################################"},
                        {"##  life: | | |                                                                                                            ##"},
                        {"###                                                                                                                       ###"},
                        {"####                                                                                                                     ####"},
                        {"#####                                                                                                                   #####"},
                        {"######      OOOOOOOOOOOOOOOOOOOOOOOOOOOOOO                                OOOOOOOOOOOOOOOOOO       OOOOOOOOOOOOOOOOOOOO######"},
                        {"#######     OOOOOOOOOOOOOOOOOOOOOOOOOOOOOO                                OOOOOOOOOOOOOOOOOO      OOOOOOOOOOOOOOOOOOOO#######"},
                        {"########                                                                                                             ########"},
                        {"#########                                                                                                           #########"},
                        {"##########                                                                                                         ##########"},
                        {"OOOOOOOOOOOOOOOOOOOOOOOOO                        ##########################                        OOOOOOOOOOOOOOOOOOOOOOOOOO"},
                        {"OOOOOOOOOOOOOOOOOOOOOOOOO                                                                          OOOOOOOOOOOOOOOOOOOOOOOOOO"},
                        {"#############                                                                                                   #############"},
                        {"##############                                                                                                 ##############"},
                        {"###############                                                                                               ###############"},
                        {"################         ###########                                                                         ################"},
                        {"#############################################################################################################################"}};
//修改规则：
//显然电脑屏幕外是不能动的只能修改里面梯形
//  墙~#   砖块~0  空气~' '
//小球在倒数第七行   23~27列之间随机生成，不能占位
//左下角是木板生成地，左上是生命  不可改（要改需调参数）
//-----------------------------------------------------------------------------------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------------------------------------------------------------------------------
//全局变量区，在init里面改变
char wall,
    food, air, brick;
int width2, length2;
double X2, Y2, x2, y2, Vx, Vy, t2, V; //默认向下向右为正
int old_x2, old_y2, head2, tail2, max2, step2, if_miss, food_num, goal, color, add_x, add_y, cnt;
int if_load_snake_mod, debug, life;                  //debug模式调成1手动开启
int temp_x2, temp_y2, menu_x, menu_y, left2, right2; //临时坐标
double C[8] = {0, 10, 30, 55, 90};                   //初始斜抛的角度，自右向上转角(目前已调整好最好的角度)

struct Step //轨迹
{
    int x2;
    int y2;
} s[1000];

void HideCursor() //光标隐藏
{
    CONSOLE_CURSOR_INFO cursor_info = {1, 0}; //后边的0代表光标不可见
    SetConsoleCursorInfo(GetStdHandle(STD_OUTPUT_HANDLE), &cursor_info);
}

void gotoxy(int x, int y) //坐标函数
{
    HANDLE handle = GetStdHandle(STD_OUTPUT_HANDLE);
    COORD pos;
    pos.X = x;
    pos.Y = y;
    SetConsoleCursorPosition(handle, pos);
}







void init_start()
{ // 开机 + 动态加载页面 + 打开输入密码权限
    int i, l, j;
    gotoxy(0, 0);
    for (i = 0; i <= 16; i++)
    {
        printf("%s\n", start[i]);
        Sleep(100);
    }

    for (l = 0; l < 3; l++)
    { //动态加载
        for (i = 53; i <= 71; i = i + 2)
        {
            for (j = i - 4; j <= i; j = j + 2)
            {
                if (j >= 53 && j <= 70)
                {
                    gotoxy(j, 12);
                    printf("[]");
                }
                Sleep(100);
            }
            for (j = i - 4; j <= i; j = j + 2)
            {
                if (j >= 53 && j <= 70)
                {
                    gotoxy(j, 12);
                    printf("  ");
                }
            }
        }
    }
    gotoxy(0, 0);
    for (i = 0; i <= 16; i++)
    {
        printf("%s\n", password[i]);
        Sleep(10);
    }
    if_input = 1; //  9 77    18个
    input_x = 9;
    input_y = 77;
    input_max = 18;
}
void load_desktop()
{ //加载桌面
    int i;
    cx = 1, cy = 1;
    if_into_desktop = 1;
    if_input == 0;
    gotoxy(0, 0);

    for (i = 0; i <= 16; i++)
    {
        printf("%s\n", desktop[i]);
        Sleep(100);
    }
}
void end()
{ //加载关机
    int i;
    system("color 70");
    //Windows 正在关机...
    char temp1[30] = {"│     正在注销....   │"};
    char temp2[30] = {"│ Windows 正在关机...│"};
    gotoxy(0, 0);
    if_input = 0;
    gotoxy(0, 0);
    for (i = 0; i <= 16; i++)
    {
        printf("%s\n", start[i]);
        Sleep(10);
    }
    gotoxy(51, 12);
    printf("%s", temp1);
    Sleep(3000);
    gotoxy(51, 12);
    printf("%s", temp2);
    Sleep(4000);
    gotoxy(0, 0);
    for (i = 0; i <= 16; i++)
    {
        printf("%s\n", map[i]);
        Sleep(10);
    }
}
void blue_screen() //蓝屏
{
    int i, j, l = 2, r = 122, hei = 16, len = 124;
    SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 30);
    gotoxy(0, 0);
    if_into_desktop = 0;
    for (i = 1; i <= hei; i++)
    { //打印地图
        for (j = 0; j <= len; j++)
        {
            if (j >= l && j <= r)
            {
                gotoxy(j, i);
                printf("%c", ending[i][j]);
            }
        }
        l++;
        r--;
        Sleep(50);
        printf("\n");
    }
    getch();
    getch();
    getch();
    system("color 70");
    end();
    if_start = 0;
    if_into_desktop = 0;
    if_input = 0;
}
void my_computer()
{
    int i;
    gotoxy(0, 0);
    for (i = 0; i <= 16; i++)
    {
        printf("%s\n", MyComputer[i]);
        Sleep(10);
    }
    getch();
    gotoxy(0, 0);
    for (i = 0; i <= 16; i++)
    {
        printf("%s\n", desktop[i]);
        Sleep(100);
    }
}

void load_more()
{ //更多信息

    int i;
    gotoxy(0, 0);

    for (i = 0; i <= 16; i++)
    {
        printf("%s\n", thinking[i]);
        Sleep(1000);
    }
}
void load_game()
{ //加载汉诺塔程序
    int i;
    if_into_desktop = 0;
    gotoxy(0, 0);

    for (i = 0; i <= 16; i++)
    {
        printf("%s\n", game_hnt[i]);
        Sleep(100);
    }
    if_game = 1;
    gotoxy(mid_y - 16, mid_x);
    printf("请输入你要递归的汉诺塔数目_");
    input_x = mid_x;
    input_y = mid_y - 16 + 27;
    input_max = 1;
    if_input = 1;
}












int main()
{
    if_my_map = 0; //是否加载自己设置的关卡，改成1后  my_map数组就是内置地图
    HideCursor();
    init();
    /*load_desktop(); //直接进入桌面
    if_start = 1;
    if_into_desktop = 1;*/
    HideCursor();
    while (1)
    {                     //主循环w
        if (if_game == 2) //打砖块
            autochange();
        if (kbhit())
        {
            flag = move(); //move提取读取的键盘按键并判断类型
            switch (flag)
            {
            case 0:
                break; //暂无效果的按键
            case 1:
                put_letter_to_computer(letter);
                break; //返回字符型按键给电脑
            case 2:
                put_function_to_computer(function);
                break; //返回功能型按键给电脑
            }
        }
    }
    getchar();
}